In [57]:
import pandas as pd
import re

## Movies

In [58]:
movies = pd.read_json('genome/movies.jsonl', lines=True)
movies.head(5)

,item_id,title,genres,directedBy,starring,avgRating,imdbId
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,John Lasseter,"Tim Allen, Tom Hanks, Don Rickles, Jim Varney,...",3.89146,114709
1,2,Jumanji (1995),Adventure|Children|Fantasy,Joe Johnston,"Jonathan Hyde, Bradley Pierce, Robin Williams,...",3.26605,113497
2,3,Grumpier Old Men (1995),Comedy|Romance,Howard Deutch,"Jack Lemmon, Walter Matthau, Ann-Margret , Sop...",3.17146,113228
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,Forest Whitaker,"Angela Bassett, Loretta Devine, Whitney Housto...",2.86824,114885
4,5,Father of the Bride Part II (1995),Comedy,Charles Shyer,"Steve Martin, Martin Short, Diane Keaton, Kimb...",3.07620,113041

## Adding year

In [59]:
def extract_year(title):
    """
    Extracts the year from a movie title.

    Parameters:
    - title (str): The title of the movie, which contains the year in parentheses.

    Returns:
    - int: The extracted year as an integer, or None if no year is found.
    """
    match = re.search(r'\((\d{4})\)', title)
    if match:
        return int(match.group(1))
    return None

In [60]:
movies['year'] = movies['title'].apply(extract_year)
movies.head(5)

,item_id,title,genres,directedBy,starring,avgRating,imdbId,year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,John Lasseter,"Tim Allen, Tom Hanks, Don Rickles, Jim Varney,...",3.89146,114709,1995.0
1,2,Jumanji (1995),Adventure|Children|Fantasy,Joe Johnston,"Jonathan Hyde, Bradley Pierce, Robin Williams,...",3.26605,113497,1995.0
2,3,Grumpier Old Men (1995),Comedy|Romance,Howard Deutch,"Jack Lemmon, Walter Matthau, Ann-Margret , Sop...",3.17146,113228,1995.0
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,Forest Whitaker,"Angela Bassett, Loretta Devine, Whitney Housto...",2.86824,114885,1995.0
4,5,Father of the Bride Part II (1995),Comedy,Charles Shyer,"Steve Martin, Martin Short, Diane Keaton, Kimb...",3.07620,113041,1995.0

In [61]:
nan_counts = movies.isnull().sum()
nan_counts

item_id           0
title             0
genres        11185
directedBy        0
starring          0
avgRating         0
imdbId            0
year            667
dtype: int64

In [62]:
empty_string_counts = (movies == '').sum()
empty_string_counts

item_id          0
title            0
genres           0
directedBy    3147
starring      6883
avgRating        0
imdbId           0
year             0
dtype: int64

## Seperate genres

In [63]:
# Create a separate table for genres
movies_genres = movies[['item_id', 'genres']].copy()

# Split genres into separate rows
movies_genres = movies_genres.assign(genre=movies_genres['genres'].str.split('|')).explode('genre')

# Drop the original 'genres' column
movies_genres = movies_genres[['item_id', 'genre']]

# Create a table for unique genres with genre_id
unique_genres = movies_genres['genre'].unique()
genres = pd.DataFrame({'genre_id': range(1, len(unique_genres) + 1), 'genre_name': unique_genres})

# Map genre names to genre ids in movies_genres
genre_mapping = dict(zip(genres['genre_name'], genres['genre_id']))
movies_genres['genre_id'] = movies_genres['genre'].map(genre_mapping)

# Drop the 'genre' column from movies_genres as we have replaced it with genre_id
movies_genres = movies_genres[['item_id', 'genre_id']]

In [64]:
movies_genres.nunique()

item_id     84661
genre_id       21
dtype: int64

In [65]:
movies_genres.head(5)

   item_id  genre_id
0        1         1
0        1         2
0        1         3
0        1         4
0        1         5

In [66]:
genres.head(5)

   genre_id genre_name
0         1  Adventure
1         2  Animation
2         3   Children
3         4     Comedy
4         5    Fantasy

In [67]:
len(genres)

21

## Seperate starring

In [68]:
# Create a separate table for starring (actors/actresses)
movies_actors = movies[['item_id', 'starring']].copy()

# Define a function to split actors based on multiple delimiters (comma, tab, newline)
def split_actors(starring):
    return re.split(r'[,\t\n]+', starring)

# Split starring into separate rows based on multiple delimiters
movies_actors = movies_actors.assign(actor=movies_actors['starring'].apply(split_actors)).explode('actor')

# Strip any leading/trailing whitespace from actor names
movies_actors['actor'] = movies_actors['actor'].str.strip()

# Drop the original 'starring' column
movies_actors = movies_actors[['item_id', 'actor']]

# Create a table for unique actors with actor_id
unique_actors = movies_actors['actor'].unique()
actors = pd.DataFrame({'actor_id': range(1, len(unique_actors) + 1), 'actor_name': unique_actors})

# Map actor names to actor ids in movies_actors
actor_mapping = dict(zip(actors['actor_name'], actors['actor_id']))
movies_actors['actor_id'] = movies_actors['actor'].map(actor_mapping)

# Drop the 'actor' column from movies_actors as we have replaced it with actor_id
movies_actors = movies_actors[['item_id', 'actor_id']]

In [69]:
movies_actors.nunique()

item_id      84661
actor_id    122970
dtype: int64

In [70]:
movies_actors.head(5)

   item_id  actor_id
0        1         1
0        1         2
0        1         3
0        1         4
0        1         5

In [71]:
actors.head(5)

   actor_id         actor_name
0         1          Tim Allen
1         2          Tom Hanks
2         3        Don Rickles
3         4         Jim Varney
4         5  John Ratzenberger

In [72]:
len(actors)

122970

In [73]:
movies.drop(columns=['genres', 'starring'], inplace=True)
movies.head(5)

,item_id,title,directedBy,avgRating,imdbId,year
0,1,Toy Story (1995),John Lasseter,3.89146,114709,1995.0
1,2,Jumanji (1995),Joe Johnston,3.26605,113497,1995.0
2,3,Grumpier Old Men (1995),Howard Deutch,3.17146,113228,1995.0
3,4,Waiting to Exhale (1995),Forest Whitaker,2.86824,114885,1995.0
4,5,Father of the Bride Part II (1995),Charles Shyer,3.07620,113041,1995.0

## Seperating director

In [74]:
# Create a separate table for directedBy (directors)
movies_directors = movies[['item_id', 'directedBy']].copy()

# Define a function to split directors based on multiple delimiters (comma, tab, newline)
def split_directors(directedBy):
    return re.split(r'[,\t\n]+', directedBy)

# Split directedBy into separate rows based on multiple delimiters
movies_directors = movies_directors.assign(director=movies_directors['directedBy'].apply(split_directors)).explode('director')

# Strip any leading/trailing whitespace from director names
movies_directors['director'] = movies_directors['director'].str.strip()

# Drop the original 'directedBy' column
movies_directors = movies_directors[['item_id', 'director']]

# Create a table for unique directors with director_id
unique_directors = movies_directors['director'].unique()
directors = pd.DataFrame({'director_id': range(1, len(unique_directors) + 1), 'director_name': unique_directors})

# Map director names to director ids in movies_directors
director_mapping = dict(zip(directors['director_name'], directors['director_id']))
movies_directors['director_id'] = movies_directors['director'].map(director_mapping)

# Drop the 'director' column from movies_directors as we have replaced it with director_id
movies_directors = movies_directors[['item_id', 'director_id']]

In [75]:
movies.head(5)

,item_id,title,directedBy,avgRating,imdbId,year
0,1,Toy Story (1995),John Lasseter,3.89146,114709,1995.0
1,2,Jumanji (1995),Joe Johnston,3.26605,113497,1995.0
2,3,Grumpier Old Men (1995),Howard Deutch,3.17146,113228,1995.0
3,4,Waiting to Exhale (1995),Forest Whitaker,2.86824,114885,1995.0
4,5,Father of the Bride Part II (1995),Charles Shyer,3.07620,113041,1995.0

In [76]:
directors.head(5)

   director_id    director_name
0            1    John Lasseter
1            2     Joe Johnston
2            3    Howard Deutch
3            4  Forest Whitaker
4            5    Charles Shyer

In [77]:
len(directors)

33593

In [78]:
movies_directors.head(5)

   item_id  director_id
0        1            1
1        2            2
2        3            3
3        4            4
4        5            5

In [79]:
import os

# Define the directory name
directory_name = 'separated_movies'

# Check if the directory already exists
if not os.path.exists(directory_name):
    os.mkdir(directory_name)
    print(f"Directory '{directory_name}' created.")
else:
    print(f"Directory '{directory_name}' already exists.")

Directory 'separated_movies' already exists.

In [80]:
movies.to_json('separated_movies/movies.jsonl', orient='records', lines=True, indent=False)
genres.to_json('separated_movies/genres.jsonl', orient='records', lines=True, indent=False)
actors.to_json('separated_movies/actors.jsonl', orient='records', lines=True, indent=False)
directors.to_json('separated_movies/directors.jsonl', orient='records', lines=True, indent=False)
movies_genres.to_json('separated_movies/movies_genres.jsonl', orient='records', lines=True, indent=False)
movies_actors.to_json('separated_movies/movies_actors.jsonl', orient='records', lines=True, indent=False)
movies_directors.to_json('separated_movies/movies_directors.jsonl', orient='records', lines=True, indent=False)

In [81]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://admin:admin@localhost:5432/movielens')
engine.connect()

In [82]:
movies.to_sql('movies', engine, if_exists='replace', index=False)
genres.to_sql('genres', engine, if_exists='replace', index=False)
actors.to_sql('actors', engine, if_exists='replace', index=False)
directors.to_sql('directors', engine, if_exists='replace', index=False)
movies_genres.to_sql('movies_genres', engine, if_exists='replace', index=False)
movies_actors.to_sql('movies_actors', engine, if_exists='replace', index=False)
movies_directors.to_sql('movies_directors', engine, if_exists='replace', index=False)

487

## Ratings

In [83]:
ratings = pd.read_json('genome/ratings.jsonl', nrows=1000, lines=True)
ratings.head()

   item_id  user_id  rating
0        5   997206       3
1       10   997206       4
2       13   997206       4
3       17   997206       5
4       21   997206       4

In [84]:
reviews = pd.read_json('genome/reviews.jsonl', nrows=1000, lines=True)
reviews.head()

   item_id                                                txt
0   172063  one-shot record of a belly dancer; "Carmencita...
1    95541  Banging Away..; Thomas Edison and William K.L....
2     7065  unbelievable; I cannot understand how anyone c...
3     3739  I'm still starry-eyed from it; I saw this last...
4     1562  Failed on every Front; Joel Schumacher who did...